# CannotDrawSweep Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SweepFailures..::..CannotDrawSweep Property
BuiltInFailures..::..SweepFailures Class See Also
---
Can't create sweep.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawSweep { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawSweep As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawSweep {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SweepFailures Class
Autodesk.Revit.DB Namespace